In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Load Data

In [13]:
df = pd.read_csv('data/7wonders.csv')
df.dropna(axis=1, inplace=True)

In [14]:
df.head(10)

,Jogo#,Jogador,Militar,Riqueza,Maravilha,Civil,Comércio,Ciência,Guilda,Cidade,Total
0,1,Radif,10,0,13,14,3,0,29,2,71
1,1,Guga,1,7,10,3,3,36,5,4,69
2,1,Rajiv,8,4,3,12,9,18,0,8,62
3,1,Lais,1,8,10,26,5,0,0,0,50
4,2,Rajiv,-3,4,10,0,0,64,10,2,87
5,2,Clara,7,13,7,31,7,0,0,0,65
6,2,Lais,4,3,7,18,0,0,0,14,46
7,2,Theo,8,3,5,14,3,0,14,2,49
8,3,Theo,18,3,10,11,2,0,13,0,57
9,3,Radif,-2,5,5,24,4,0,12,0,48

List of matches

In [15]:
matches = list(set(df['Jogo#']))
print(matches)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66]

Set index to Jogo# so df.loc\[match_number\] can refer to a single match

In [16]:
df_indexed = df.set_index('Jogo#')
df_indexed.head(10)

,Jogador,Militar,Riqueza,Maravilha,Civil,Comércio,Ciência,Guilda,Cidade,Total
Jogo#,,,,,,,,,,
1,Radif,10,0,13,14,3,0,29,2,71
1,Guga,1,7,10,3,3,36,5,4,69
1,Rajiv,8,4,3,12,9,18,0,8,62
1,Lais,1,8,10,26,5,0,0,0,50
2,Rajiv,-3,4,10,0,0,64,10,2,87
2,Clara,7,13,7,31,7,0,0,0,65
2,Lais,4,3,7,18,0,0,0,14,46
2,Theo,8,3,5,14,3,0,14,2,49
3,Theo,18,3,10,11,2,0,13,0,57
3,Radif,-2,5,5,24,4,0,12,0,48

In [17]:
df_indexed['Posicao'] = 0
df_indexed.head(10)

,Jogador,Militar,Riqueza,Maravilha,Civil,Comércio,Ciência,Guilda,Cidade,Total,Posicao
Jogo#,,,,,,,,,,,
1,Radif,10,0,13,14,3,0,29,2,71,0
1,Guga,1,7,10,3,3,36,5,4,69,0
1,Rajiv,8,4,3,12,9,18,0,8,62,0
1,Lais,1,8,10,26,5,0,0,0,50,0
2,Rajiv,-3,4,10,0,0,64,10,2,87,0
2,Clara,7,13,7,31,7,0,0,0,65,0
2,Lais,4,3,7,18,0,0,0,14,46,0
2,Theo,8,3,5,14,3,0,14,2,49,0
3,Theo,18,3,10,11,2,0,13,0,57,0
3,Radif,-2,5,5,24,4,0,12,0,48,0